ДемоПримерыОбменов/src/InformationRegisters/ДатыБронирований/ДатыБронирований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыБронирований</name>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номер</name>
    <type>
      <types>CatalogRef.Номера</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДемоПримерыОбменов/src/HTTPServices/booking/Module.bsl
#Область ОбработчикиСобытий

Функция ДобавитьБронирование(Запрос)
	
	Попытка
		ТипКонтента = ЗаголовокЗапросаПоИмени(Запрос.Заголовки, "Content-Type");
		
		Если Не СтрНачинаетсяС(ТипКонтента, "application/json") Тогда
			Возврат ОтветСОписаниеОшибкиФорматаДанных("Ожидается тело в формате JSON");
		КонецЕсли;
		
		ТелоЗапроса = Запрос.ПолучитьТелоКакСтроку();
		
		Попытка
			ДанныеТела = ПрочитатьЗначениеJSON(ТелоЗапроса);
		Исключение
			Возврат ОтветСОписаниеОшибкиФорматаДанных("Нарушена структура JSON");
		КонецПопытки;
		
		Ошибки = "";
		ДанныеНовогоБронирования = ПрочитатьДанныеНовогоБронирования(ДанныеТела, Ошибки);
		
		Если Не ПустаяСтрока(Ошибки) Тогда
			Возврат ОтветСОписаниеОшибкиФорматаДанных(Ошибки);
		КонецЕсли;		
		
		Запись = РегистрыСведений.ДатыБронирований.СоздатьМенеджерЗаписи();
		Запись.Номер = ДанныеНовогоБронирования.Номер;
		Запись.ДатаНачала = ДанныеНовогоБронирования.ДатаНачала;
		Запись.ДатаОкончания = ДанныеНовогоБронирования.ДатаОкончания;
		
		Запись.Записать();
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.УстановитьТелоИзСтроки(ТелоЗапроса);
		Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
		
		Возврат Ответ;
	Исключение
		ЗаписьЖурналаРегистрации("БронированияHTTP.ОшибкаОбработкиЗапроса", 
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.HTTPСервисы.booking,,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("Внутренняя ошибка сервера");
		Ответ.Заголовки.Вставить("Content-Type", "text/plain; charset=utf-8");
		Возврат Ответ;
	КонецПопытки;
	
КонецФункции

Функция ПолучитьБронирования(Запрос)
	
	Ошибки = "";
	Фильтры = ПрочитатьФильтры(Запрос.ПараметрыЗапроса, Ошибки);
	
	Если Не ПустаяСтрока(Ошибки) Тогда
		Возврат ОтветСОписаниеОшибкиФорматаДанных(Ошибки);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДатыБронирований.Номер КАК Номер,
		|	ДатыБронирований.ДатаНачала КАК ДатаНачала,
		|	ДатыБронирований.ДатаОкончания КАК ДатаОкончания
		|ИЗ
		|	РегистрСведений.ДатыБронирований КАК ДатыБронирований";
		
	ПрименитьФильтры(Запрос, Фильтры);
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеОтвета = Новый Массив;
		
	Пока Выборка.Следующий() Цикл
		
		ДанныеБронирования = Новый Структура;
		ДанныеБронирования.Вставить("room_id", Строка(Выборка.Номер.УникальныйИдентификатор()));
		ДанныеБронирования.Вставить("start_date", ЗаписатьДатуJSON(Выборка.ДатаНачала, ФорматДатыJSON.ISO));
		ДанныеБронирования.Вставить("end_date", ЗаписатьДатуJSON(Выборка.ДатаОкончания, ФорматДатыJSON.ISO));
		
		ДанныеОтвета.Добавить(ДанныеБронирования);
		
	КонецЦикла;

	ТелоОтвета = ЗаписатьЗначениеJSON(ДанныеОтвета);
		
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	Возврат Ответ;
	
КонецФункции

Функция ПолучитьНомера(Запрос)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номера.Код КАК Код,
		|	Номера.Наименование КАК Наименование,
		|	Номера.Ссылка КАК Ссылка,
		|	Номера.Описание КАК Описание
		|ИЗ
		|	Справочник.Номера КАК Номера";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	ДанныеОтвета = Новый Массив;
		
	Пока Выборка.Следующий() Цикл
		
		ДанныеНомера = Новый Структура;
		ДанныеНомера.Вставить("id", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		ДанныеНомера.Вставить("name", Выборка.Наименование);
		ДанныеНомера.Вставить("code", Выборка.Код);
		ДанныеНомера.Вставить("description", Выборка.Описание);
		
		ДанныеОтвета.Добавить(ДанныеНомера);
		
	КонецЦикла;

	ТелоОтвета = ЗаписатьЗначениеJSON(ДанныеОтвета);
		
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	Возврат Ответ;
	
КонецФункции

Функция ПроверитьДоступность(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.УстановитьТелоИзСтроки("Ok");
	Возврат Ответ;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьДанныеНовогоБронирования(ДанныеТела, ОшибкиПреобразования)
	
	Ошибки = Новый Массив;
	
	ПоляТелаЗапроса = 
		"room_id,
		|start_date,
		|end_date";
		
	БезопасныеДанныеТела = Новый Структура(ПоляТелаЗапроса);
	ЗаполнитьЗначенияСвойств(БезопасныеДанныеТела, ДанныеТела);
	
	Результат = Новый Структура;
	Результат.Вставить("Номер", ПолучитьНомер(БезопасныеДанныеТела.room_id, Ошибки));
	Результат.Вставить("ДатаНачала", ПолучитьДату(БезопасныеДанныеТела.start_date, Ошибки, "start_date"));
	Результат.Вставить("ДатаОкончания", ПолучитьДату(БезопасныеДанныеТела.end_date, Ошибки, "end_date"));
	
	ОшибкиПреобразования = СтрСоединить(Ошибки, Символы.ПС);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДату(Строка, Ошибки, ИмяПоля)
	
	Если Не ЗначениеЗаполнено(Строка) Тогда
		Ошибки.Добавить("Отсутствует обязательное поле " + ИмяПоля);
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат ПрочитатьДатуJSON(Строка, ФорматДатыJSON.ISO);
	Исключение
		Ошибки.Добавить("Неверный формат поля " + ИмяПоля);
		Возврат Неопределено;
	КонецПопытки;

КонецФункции

Функция ПолучитьНомер(ИдентификаторНомера, Ошибки)
	
	Если Не ЗначениеЗаполнено(ИдентификаторНомера) Тогда
		Ошибки.Добавить("Отсутствует обязательное поле room_id");
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЭтоУникальныйИдентификатор(ИдентификаторНомера) Тогда
		Ошибки.Добавить("room_id не является UUID");
		Возврат Неопределено;
	КонецЕсли;
	
	Ссылка = Справочники.Номера.ПолучитьСсылку(Новый УникальныйИдентификатор(ИдентификаторНомера));
	
	Если Не НомерСуществует(Ссылка) Тогда
		Ошибки.Добавить("Номера с указанным room_id не существует");
		Возврат Неопределено;
	КонецЕсли;
			
	Возврат Ссылка;
	
КонецФункции

// Функция проверяет, что строка является UUID через регулярное выражение
// Параметры:
//   Строка - Строка - строка, которую необходимо проверить
// Возвращаемое значение:
//   Булево - Истина, если строка является UUID
Функция ЭтоУникальныйИдентификатор(Строка)
	
	РегулярноеВыражение = "^[0-9a-fA-F]{8}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{4}-[0-9a-fA-F]{12}$";
	Возврат СтрПодобнаПоРегулярномуВыражению(Строка, РегулярноеВыражение);
	
КонецФункции

// Проверяет существование номера в справочнике по заданной ссылке.
//
// Параметры:
//   Ссылка - СправочникСсылка.Номера - Ссылка на проверяемый элемент справочника
//
// Возвращаемое значение:
//   Булево - Истина, если номер существует; Ложь в противном случае
Функция НомерСуществует(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номера.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Номера КАК Номера
		|ГДЕ
		|	Номера.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Возврат Не Запрос.Выполнить().Пустой();

КонецФункции

// Возвращает значение заголовка HTTP-запроса по имени без учета регистра символов
//
// Параметры:
//   Заголовки - Соответствие из Строка, Строка - соответствие заголовков HTTP-запроса
//   ИмяЗаголовка - Строка - имя искомого заголовка
//
// Возвращаемое значение:
//   Строка - значение заголовка
//   Неопределено - заголовок не найден
Функция ЗаголовокЗапросаПоИмени(Заголовки, ИмяЗаголовка)
	
	Результат = Заголовки.Получить(ИмяЗаголовка);
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = Заголовки.Получить(НРег(ИмяЗаголовка));
	
	Если Результат <> Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого Заголовок Из Заголовки Цикл
		Если ВРег(Заголовок.Ключ) = ВРег(ИмяЗаголовка) Тогда
			Возврат Заголовок.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Неопределено;

КонецФункции

Функция ОтветСОписаниеОшибкиФорматаДанных(ТекстОшибки)
	
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("error", Истина);
	ДанныеОтвета.Вставить("details", ТекстОшибки);
	
	ТелоОтвета = ЗаписатьЗначениеJSON(ДанныеОтвета);
	
	Ответ = Новый HTTPСервисОтвет(400);
	Ответ.УстановитьТелоИзСтроки(ТелоОтвета);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	Возврат Ответ;	
	
КонецФункции

// Применяет фильтры к тексту запроса на основе переданных параметров
//
// Параметры:
//   Запрос - Запрос - исходный запрос для применения фильтров
//   Фильтры - см. ПрочитатьФильтры
Процедура ПрименитьФильтры(Запрос, Фильтры)
	
	Схема = Новый СхемаЗапроса();
	Схема.УстановитьТекстЗапроса(Запрос.Текст);
	
	ЗапросПакета = Схема.ПакетЗапросов[0];
	Оператор = ЗапросПакета.Операторы[0];
	
	Если Фильтры.Номер <> Неопределено Тогда
		Оператор.Отбор.Добавить("ДатыБронирований.Номер В (&Номера)");
		Запрос.УстановитьПараметр("Номера", Фильтры.Номер);
	КонецЕсли;
	
	Если Фильтры.ДатаНачала <> Неопределено Тогда
		Оператор.Отбор.Добавить("ДатыБронирований.ДатаОкончания > &ДатаНачала");
		Запрос.УстановитьПараметр("ДатаНачала", Фильтры.ДатаНачала);
	КонецЕсли;
	
	Если Фильтры.ДатаОкончания <> Неопределено Тогда
		Оператор.Отбор.Добавить("ДатыБронирований.ДатаНачала < &ДатаОкончания");
		Запрос.УстановитьПараметр("ДатаОкончания", Фильтры.ДатаОкончания);
	КонецЕсли;
		
	Запрос.Текст = Схема.ПолучитьТекстЗапроса();
	
КонецПроцедуры

// Формирует структуру с отборами по номеру и датам из параметров HTTP-запроса.
//
// Параметры:
//   ПараметрыЗапроса - Соответствие из Строка, Строка - параметры HTTP-запроса
//   ОшибкиСтрокой - Строка - для накопления текста ошибок валидации
//
// Возвращаемое значение:
//   Структура:
//     * Номер - Неопределено, Массив из СправочникСсылка.Номера - массив ссылок на номера
//     * ДатаНачала - Неопределено, Дата - дата начала периода
//     * ДатаОкончания - Неопределено, Дата - дата окончания периода
Функция ПрочитатьФильтры(ПараметрыЗапроса, ОшибкиСтрокой)
		
	Результат = Новый Структура;
	Результат.Вставить("Номер");
	Результат.Вставить("ДатаНачала");
	Результат.Вставить("ДатаОкончания");
	
	ОтборПоНомеру = ПараметрыЗапроса.Получить("room_id");
	Если ЗначениеЗаполнено(ОтборПоНомеру) Тогда
		Номера = Новый Массив;
		ИдентификаторыНомеров = СтрРазделить(ОтборПоНомеру, ",");
		Для Каждого Идентификатор Из ИдентификаторыНомеров Цикл
			Если ЭтоУникальныйИдентификатор(Идентификатор) Тогда
				Номера.Добавить(Справочники.Номера.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор)));
			КонецЕсли;
		КонецЦикла;
		Результат.Номер = Номера;
	КонецЕсли;
	
	ОтборПоДатеНачала = ПараметрыЗапроса.Получить("start_date");
	Если ЗначениеЗаполнено(ОтборПоДатеНачала) Тогда
		Результат.ДатаНачала = ПолучитьДату(ОтборПоДатеНачала, ОшибкиСтрокой, "start_date");
	КонецЕсли;
	
	ОтборПоДатеОкончания = ПараметрыЗапроса.Получить("end_date");
	Если ЗначениеЗаполнено(ОтборПоДатеОкончания) Тогда
		Результат.ДатаОкончания = ПолучитьДату(ОтборПоДатеОкончания, ОшибкиСтрокой, "end_date");
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
